#!/bin/sh
set -eu

######################################################################
# 端末制御の関数を定義
######################################################################

# 端末設定を変更
init_tty()     { stty -icanon -echo min 1 -ixon; }
# 端末設定を復帰
quit_tty()     { stty icanon echo ixon eof '^d'; }

# スクリーンをクリア
clear_screen() { printf '\033[H\033[2J';     }
# 新規のスクリーンをオープン
open_screen()  { printf '\033\067\033[?47h'; }
# 現在のスクリーンをクローズ
close_screen() { printf '\033[?47l\033\070'; }

######################################################################
# シグナルに対するアクションを設定
######################################################################

# 親プロセス（自身）に対する終了シグナルは無視
trap : TERM

######################################################################
# 前準備
######################################################################

init_tty
open_screen
clear_screen

######################################################################
# 設定
######################################################################


ncol=61    # フレームの幅
nrow=42    # フレームの高さ
msec=100   # フレームあたりの表示時間（ミリ秒）
nrep=110   # フレームの繰り返し回数
wtime=1000 # 起動時の待ち時間（表示時間）

######################################################################
# 本体処理
######################################################################

# サブプロセスに切り離して描画を実行
(
  # ベースのフレームを複製
  repeat.sh -n"$nrep" "text/base.txt"                                |

  # 鏡面の色を変化
  strgrad.sh -r"$nrow" -c"Ｘ" -s"ＲＵＩＱＰＳ" -l -f6                |

  # 頭の波紋
  ripple.sh -r"$nrow" -c"$ncol" -s1 -m50 -p"31,10" -l -a"Ｈ" -w20    |
  
  # 腕の波紋
  ripple.sh -r"$nrow" -c"$ncol" -s1 -m50 -p"26,18" -l -a"Ｈ" -w10    |
  ripple.sh -r"$nrow" -c"$ncol" -s1 -m50 -p"36,18" -l -a"Ｈ" -w11    |

  # 足の波紋
  ripple.sh -r"$nrow" -c"$ncol" -s1 -m50 -p"36,30" -l -a"Ｈ" -w22    |
  ripple.sh -r"$nrow" -c"$ncol" -s1 -m50 -p"26,30" -l -a"Ｈ" -w26    |
  
  # お腹の波紋
  ripple.sh -r"$nrow" -c"$ncol" -s1 -m50 -p"31,25" -l -a"Ｈ" -w24    |

  # 鏡の形を切り取る
  overwrite.sh -r"$nrow" -c"$ncol" -f"text/mirror_filter.txt"        |

  # 波紋を白色に変換
  tr 'Ｈ' 'Ｗ'                                                       |

  # アスキーエスケープシーケンスに変換
  color2escseq.sh                                                    |
  
  # 出力位置を調整
  resetcursor.sh -r"$nrow"                                           |
  
  # 出力速度を調整
  linevalve -m"$msec" -r"$nrow" -w"$wtime"
) &

######################################################################
# キー入力を制御
######################################################################

while true
do
  key=$(dd bs=1 count=1 2> /dev/null)
  
  case "$key" in
    q)
      # サブプロセスを終了させる
      kill -TERM 0
      break
      ;;
    *)
      :
      ;;
  esac
done

######################################################################
# 後始末
######################################################################

clear_screen
close_screen
quit_tty
