#!/bin/sh
set -eu

######################################################################
# 設定
######################################################################

nrow=41
ncol=61

######################################################################
# 本体処理
######################################################################

{
  # ディスクの外縁
  calccircle.sh 31,21,19
  # ディスクの内縁
  calccircle.sh 31,21,3

  # ディスクの中央の透明部分
  calccircle.sh 31,21,5
  calccircle.sh 31,21,7
}                                                                    |

# 描画
crd2draw.sh -r"$nrow" -c"$ncol"                                      |

# ディスクの記録面を白色で埋める
fillclosed.sh -p"31,5"                                               |

# 色アルファベットに変換
tr '□' 'Ｋ'                                                         |
tr '■' 'Ｗ'                                                         |

# アスキーエスケープシーケンスに変換
color2escseq.sh
