#!/bin/sh
set -eu

####################################################################
# 設定
####################################################################

odir='orgimg'
tdir='asciiimg'

ncol=60
nrow=50

mkdir -p "$tdir"

####################################################################
# 本体処理
####################################################################

find "$odir" -name "*.jpeg"                                        |

while read -r img
do
  ibase="${img##*/}"

  imagedecode -c"$ncol" -r"$nrow" -g "$img"                        |

  bright2ascii.sh                                                  |

  tr 　 ・                                                         |
  tr ※ ・                                                         |
  tr ＋ ・                                                         |

  cat > "${tdir}/${ibase}.txt"
done  
