#!/bin/sh
set -eu

######################################################################
# 端末制御の関数を定義
######################################################################

# 端末設定を変更
init_tty()     { stty -icanon -echo min 1 -ixon; }
# 端末設定を復帰
quit_tty()     { stty icanon echo ixon eof '^d'; }

# スクリーンをクリア
clear_screen() { printf '\033[H\033[2J';     }
# 新規のスクリーンをオープン
open_screen()  { printf '\033\067\033[?47h'; }
# 現在のスクリーンをクローズ
close_screen() { printf '\033[?47l\033\070'; }

######################################################################
# シグナルに対するアクションを設定
######################################################################

# 親プロセス（自身）に対する終了シグナルは無視
trap : TERM

######################################################################
# 前準備
######################################################################

init_tty
open_screen
clear_screen

######################################################################
# 設定
######################################################################

ncol=140   # フレームの幅
nrow=25    # フレームの高さ
msec=50    # フレームあたりの表示時間（ミリ秒）
wtime=1000 # 起動時の待ち時間（ミリ秒）
nrep=100   # フレームの繰り返し回数
dcol=60    # 切り出し後のフレームの幅

######################################################################
# 本体処理
######################################################################

# 動画を再生して次の処理に進む
(
  # ベース画像を入力
  repeat.sh -n"$nrep" "text/misakimult.txt"                          |

  # シフト
  shift.sh -r"$nrow" -c"$ncol" -u"1"                                 |
  
  # 前方を切り出す
  gawk '{ print substr($0,1,'"$dcol"'); }'                           |
  
  # 空白の見た目を変換
  sed 's/　/  /g'                                                    |
  
  # 出力位置を調整
  resetcursor.sh -r"$nrow"                                           |  

  # 出力スピードを調整
  linevalve -m"$msec" -r"$nrow" -w"$wtime"
) &

######################################################################
# キー入力を制御
######################################################################

while true
do
  key=$(dd bs=1 count=1 2> /dev/null)
  
  case "$key" in
    q)
      # 子プロセスを終了させる
      kill -TERM 0
      break
      ;;
    *)
      :
      ;;
  esac
done

######################################################################
# 後始末
######################################################################

clear_screen
close_screen
quit_tty
